ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/**
 * \brief Component description for PIC32CX/0025SD10 GLUE
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0025SD10_GLUE_COMPONENT_H_
#define _PIC32CX_0025SD10_GLUE_COMPONENT_H_

/** \addtogroup PIC32CX_0025SD10_GLUE These are the Glue Register
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR GLUE */
/* ========================================================================== */

/* -------- GLUE_PWR_GD : (GLUE Offset: 0x00) (R/W 32) This is the Power Good Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t PWRGD_DELAY:1;             /**< bit:      0  This field selects an optional delay for PWR_GOOD_3V.\n         1= Select PWR_GOOD_3V delay (default).\n         0= Select no delay for PWR_GOOD_3V.\n */
    uint32_t PWRGD_LOCK:1;              /**< bit:      1  This field sets the lock for bits[1:0] of this register.\n         1= Locked: Bits[1:0] of this register become read-only, and remain read-only until RESET_SYS reset event.\n         0= Unlocked: Bits[1:0] of this register remain R/W (default). */
    uint32_t :4;                        /**< bit:   2..5  Reserved                                      */
    uint32_t PCIRST_1_EN:1;             /**< bit:      6  This field decides whether Pin PCI_RST_1# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_1# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_1# is forced low.\n */
    uint32_t PCIRST_2_EN:1;             /**< bit:      7  This field decides whether Pin PCI_RST_2# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_2# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_2# is forced low.\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_PWR_GD_bits_t;
#define GLUE_PWR_GD_RESETVALUE              (0xC1U)                                       /**<  (GLUE_PWR_GD) This is the Power Good Register.\n  Reset Value */

#define GLUE_PWR_GD_PWRGD_DELAY_Pos           (0)                                            /**< (GLUE_PWR_GD) This field selects an optional delay for PWR_GOOD_3V.\n         1= Select PWR_GOOD_3V delay (default).\n         0= Select no delay for PWR_GOOD_3V.\n Position */
#define GLUE_PWR_GD_PWRGD_DELAY_Msk           (0x1U << GLUE_PWR_GD_PWRGD_DELAY_Pos)          /**< (GLUE_PWR_GD) This field selects an optional delay for PWR_GOOD_3V.\n         1= Select PWR_GOOD_3V delay (default).\n         0= Select no delay for PWR_GOOD_3V.\n Mask */
#define GLUE_PWR_GD_PWRGD_LOCK_Pos            (1)                                            /**< (GLUE_PWR_GD) This field sets the lock for bits[1:0] of this register.\n         1= Locked: Bits[1:0] of this register become read-only, and remain read-only until RESET_SYS reset event.\n         0= Unlocked: Bits[1:0] of this register remain R/W (default). Position */
#define GLUE_PWR_GD_PWRGD_LOCK_Msk            (0x1U << GLUE_PWR_GD_PWRGD_LOCK_Pos)           /**< (GLUE_PWR_GD) This field sets the lock for bits[1:0] of this register.\n         1= Locked: Bits[1:0] of this register become read-only, and remain read-only until RESET_SYS reset event.\n         0= Unlocked: Bits[1:0] of this register remain R/W (default). Mask */
#define GLUE_PWR_GD_PCIRST_1_EN_Pos           (6)                                            /**< (GLUE_PWR_GD) This field decides whether Pin PCI_RST_1# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_1# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_1# is forced low.\n Position */
#define GLUE_PWR_GD_PCIRST_1_EN_Msk           (0x1U << GLUE_PWR_GD_PCIRST_1_EN_Pos)          /**< (GLUE_PWR_GD) This field decides whether Pin PCI_RST_1# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_1# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_1# is forced low.\n Mask */
#define GLUE_PWR_GD_PCIRST_2_EN_Pos           (7)                                            /**< (GLUE_PWR_GD) This field decides whether Pin PCI_RST_2# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_2# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_2# is forced low.\n Position */
#define GLUE_PWR_GD_PCIRST_2_EN_Msk           (0x1U << GLUE_PWR_GD_PCIRST_2_EN_Pos)          /**< (GLUE_PWR_GD) This field decides whether Pin PCI_RST_2# is a buffered copy of LRESET_BI#.\n         1= Pin PCI_RST_2# is a buffered copy of LRESET_BI# (default).\n         0= Pin PCI_RST_2# is forced low.\n Mask */
#define GLUE_PWR_GD_Msk                       (0x000000C3UL)                                 /**< (GLUE_PWR_GD) Register Mask  */

/* -------- GLUE_S0IX_ST_DETECT_EN : (GLUE Offset: 0x04) (R/W 32) This register allows the S0ix system state to be detected, for purposes of switching to an alternate pin for the PWRGD_STATE detection. While this register is in its default state, only     the PWRGD_PS pin is used as PWRGD_STATE.     Since the S0IX_DET_EN bit is reset to 0 by every chip-level PCI Reset event, it is intended for     BIOS software to re-write it to '1' before the first subsequent entry into the S0ix state, if     switching to use the alternate PWRGD_S0IX pin is needed during the S0ix state. -------- */

typedef union
{
  struct
  {
    uint32_t S0IX_DET_EN:1;             /**< bit:      0  S0ix State detection is enabled/disable.         1= S0ix State detection is enabled according to the settings in the S0ix State Detection Configuration            Register.\n         0= S0ix State detection is not enabled (default).\n */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_S0IX_ST_DETECT_EN_bits_t;
#define GLUE_S0IX_ST_DETECT_EN_RESETVALUE   (0x00U)                                       /**<  (GLUE_S0IX_ST_DETECT_EN) This register allows the S0ix system state to be detected, for purposes of switching to an alternate pin for the PWRGD_STATE detection. While this register is in its default state, only     the PWRGD_PS pin is used as PWRGD_STATE.     Since the S0IX_DET_EN bit is reset to 0 by every chip-level PCI Reset event, it is intended for     BIOS software to re-write it to '1' before the first subsequent entry into the S0ix state, if     switching to use the alternate PWRGD_S0IX pin is needed during the S0ix state.  Reset Value */

#define GLUE_S0IX_ST_DETECT_EN_S0IX_DET_EN_Pos (0)                                            /**< (GLUE_S0IX_ST_DETECT_EN) S0ix State detection is enabled/disable.         1= S0ix State detection is enabled according to the settings in the S0ix State Detection Configuration            Register.\n         0= S0ix State detection is not enabled (default).\n Position */
#define GLUE_S0IX_ST_DETECT_EN_S0IX_DET_EN_Msk (0x1U << GLUE_S0IX_ST_DETECT_EN_S0IX_DET_EN_Pos)  /**< (GLUE_S0IX_ST_DETECT_EN) S0ix State detection is enabled/disable.         1= S0ix State detection is enabled according to the settings in the S0ix State Detection Configuration            Register.\n         0= S0ix State detection is not enabled (default).\n Mask */
#define GLUE_S0IX_ST_DETECT_EN_Msk            (0x00000001UL)                                 /**< (GLUE_S0IX_ST_DETECT_EN) Register Mask  */

