ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/* -------- GLUE_POWER_RECOVERY_MODE : (GLUE Offset: 0x08) (R/W 32) This register displays the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE last went low. -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PWR_STATE:1;               /**< bit:      7  This bit is copied Read-Only from another register.\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_POWER_RECOVERY_MODE_bits_t;
#define GLUE_POWER_RECOVERY_MODE_RESETVALUE (0x00U)                                       /**<  (GLUE_POWER_RECOVERY_MODE) This register displays the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE last went low.  Reset Value */

#define GLUE_POWER_RECOVERY_MODE_PWR_STATE_Pos (7)                                            /**< (GLUE_POWER_RECOVERY_MODE) This bit is copied Read-Only from another register.\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n Position */
#define GLUE_POWER_RECOVERY_MODE_PWR_STATE_Msk (0x1U << GLUE_POWER_RECOVERY_MODE_PWR_STATE_Pos)  /**< (GLUE_POWER_RECOVERY_MODE) This bit is copied Read-Only from another register.\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n Mask */
#define GLUE_POWER_RECOVERY_MODE_Msk          (0x00000080UL)                                 /**< (GLUE_POWER_RECOVERY_MODE) Register Mask  */

/* -------- GLUE_LED_REG : (GLUE Offset: 0x0c) (R/W 32) This is the LED register.\n -------- */

typedef union
{
  struct
  {
    uint32_t BLINK:2;                   /**< bit:   0..1  LED Blink Pattern. These bits are not always R/W to software,and may be controlled by         hardware depending on the system power state.\n         0x3= The LED selected by the COLOR bit remains steady on.\n         0x2= Reserved.\n         0x1= The LED selected by the COLOR bit blinks at 1Hz.\n         0x0= LEDs are both off. (default).\n */
    uint32_t COLOR:1;                   /**< bit:      2  This bit is not always R/W to software, and may be controlled by hardware depending         on the system power stat.\n         1= Green.\n         0= Yellow (default).\n */
    uint32_t CODE_FETCH:1;              /**< bit:      3  Allows Green LED to signal that BIOS is running. Requires also setting the COLOR bit to '1'.         This bit is forced to '0' on any PCI Reset event.\n         1= BIOS has written '1' to this bit to indicate that it is running.\n         0= BIOS has not yet written this bit; not yet running. (default).\n */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_LED_REG_bits_t;
#define GLUE_LED_REG_RESETVALUE             (0x00U)                                       /**<  (GLUE_LED_REG) This is the LED register.\n  Reset Value */

#define GLUE_LED_REG_BLINK_Pos                (0)                                            /**< (GLUE_LED_REG) LED Blink Pattern. These bits are not always R/W to software,and may be controlled by         hardware depending on the system power state.\n         0x3= The LED selected by the COLOR bit remains steady on.\n         0x2= Reserved.\n         0x1= The LED selected by the COLOR bit blinks at 1Hz.\n         0x0= LEDs are both off. (default).\n Position */
#define GLUE_LED_REG_BLINK_Msk                (0x3U << GLUE_LED_REG_BLINK_Pos)               /**< (GLUE_LED_REG) LED Blink Pattern. These bits are not always R/W to software,and may be controlled by         hardware depending on the system power state.\n         0x3= The LED selected by the COLOR bit remains steady on.\n         0x2= Reserved.\n         0x1= The LED selected by the COLOR bit blinks at 1Hz.\n         0x0= LEDs are both off. (default).\n Mask */
#define GLUE_LED_REG_BLINK(value)             (GLUE_LED_REG_BLINK_Msk & ((value) << GLUE_LED_REG_BLINK_Pos))
#define GLUE_LED_REG_COLOR_Pos                (2)                                            /**< (GLUE_LED_REG) This bit is not always R/W to software, and may be controlled by hardware depending         on the system power stat.\n         1= Green.\n         0= Yellow (default).\n Position */
#define GLUE_LED_REG_COLOR_Msk                (0x1U << GLUE_LED_REG_COLOR_Pos)               /**< (GLUE_LED_REG) This bit is not always R/W to software, and may be controlled by hardware depending         on the system power stat.\n         1= Green.\n         0= Yellow (default).\n Mask */
#define GLUE_LED_REG_CODE_FETCH_Pos           (3)                                            /**< (GLUE_LED_REG) Allows Green LED to signal that BIOS is running. Requires also setting the COLOR bit to '1'.         This bit is forced to '0' on any PCI Reset event.\n         1= BIOS has written '1' to this bit to indicate that it is running.\n         0= BIOS has not yet written this bit; not yet running. (default).\n Position */
#define GLUE_LED_REG_CODE_FETCH_Msk           (0x1U << GLUE_LED_REG_CODE_FETCH_Pos)          /**< (GLUE_LED_REG) Allows Green LED to signal that BIOS is running. Requires also setting the COLOR bit to '1'.         This bit is forced to '0' on any PCI Reset event.\n         1= BIOS has written '1' to this bit to indicate that it is running.\n         0= BIOS has not yet written this bit; not yet running. (default).\n Mask */
#define GLUE_LED_REG_Msk                      (0x0000000FUL)                                 /**< (GLUE_LED_REG) Register Mask  */

/* -------- GLUE_INTRUDER_REG : (GLUE Offset: 0x10) (R/W 32) This register provides an image of the Intruder status for the Host CPU. It also allows the CPU     to clear this status directly. This status is also provided to Firmware using the PWRBTN# and Signal     Monitor Register Set, where it can trigger Firmware interrupts. Firmware can use these notifications     to generate SMI, SCI or Wake events to the Host CPU Chipset as appropriate.\n -------- */

typedef union
{
  struct
  {
    uint32_t INTRUSION:1;               /**< bit:      0  This bit displays a copy of the bit INTRUSION in the Power-Fail and Reset Status Register.         Writing '1' to this bit position, by either Host CPU or Firmware action, clears it both in that         register and here. This is a R/WC bit.\n */
    uint32_t INTRD_STS:1;               /**< bit:      1  This is a continuous copy of the bit INTRD_STS in the Intruder Control Register.\n */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_INTRUDER_REG_bits_t;
