ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_INTRUDER_REG_RESETVALUE        (0x00U)                                       /**<  (GLUE_INTRUDER_REG) This register provides an image of the Intruder status for the Host CPU. It also allows the CPU     to clear this status directly. This status is also provided to Firmware using the PWRBTN# and Signal     Monitor Register Set, where it can trigger Firmware interrupts. Firmware can use these notifications     to generate SMI, SCI or Wake events to the Host CPU Chipset as appropriate.\n  Reset Value */

#define GLUE_INTRUDER_REG_INTRUSION_Pos       (0)                                            /**< (GLUE_INTRUDER_REG) This bit displays a copy of the bit INTRUSION in the Power-Fail and Reset Status Register.         Writing '1' to this bit position, by either Host CPU or Firmware action, clears it both in that         register and here. This is a R/WC bit.\n Position */
#define GLUE_INTRUDER_REG_INTRUSION_Msk       (0x1U << GLUE_INTRUDER_REG_INTRUSION_Pos)      /**< (GLUE_INTRUDER_REG) This bit displays a copy of the bit INTRUSION in the Power-Fail and Reset Status Register.         Writing '1' to this bit position, by either Host CPU or Firmware action, clears it both in that         register and here. This is a R/WC bit.\n Mask */
#define GLUE_INTRUDER_REG_INTRD_STS_Pos       (1)                                            /**< (GLUE_INTRUDER_REG) This is a continuous copy of the bit INTRD_STS in the Intruder Control Register.\n Position */
#define GLUE_INTRUDER_REG_INTRD_STS_Msk       (0x1U << GLUE_INTRUDER_REG_INTRD_STS_Pos)      /**< (GLUE_INTRUDER_REG) This is a continuous copy of the bit INTRD_STS in the Intruder Control Register.\n Mask */
#define GLUE_INTRUDER_REG_Msk                 (0x00000003UL)                                 /**< (GLUE_INTRUDER_REG) Register Mask  */

/* -------- GLUE_LRESET_CONFIG : (GLUE Offset: 0x100) (R/W 32) This register defines whether the LRESET_BI# input term comes from a physical pin or from the chip-level     PCI Reset input. This configuration must be completed before the first application of Main power (S0 power state). -------- */

typedef union
{
  struct
  {
    uint32_t LRESET_SOURCE:1;           /**< bit:      0  This bit define the source of LRESET_BI#.\n         1= LRESET_BI# comes from the physical pin input PCI_RESET#.\n         0= LRESET_BI# comes from the Chip-Level PCI_RST# (default).\n */
    uint32_t :6;                        /**< bit:   1..6  Reserved                                      */
    uint32_t LRESET_CONFIGURED:1;       /**< bit:      7  This bit define whether LRESET_SOURCE bit, along with chip-level pin settings are configured or not.\n         1= LRESET_BI# source is configured, and the LRESET_SOURCE bit, along with chip-level pin settings,         defines where it comes from.\n         0= LRESET_BI# source is not fully configured and forced '0' internally (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_LRESET_CONFIG_bits_t;
#define GLUE_LRESET_CONFIG_RESETVALUE       (0x00U)                                       /**<  (GLUE_LRESET_CONFIG) This register defines whether the LRESET_BI# input term comes from a physical pin or from the chip-level     PCI Reset input. This configuration must be completed before the first application of Main power (S0 power state).  Reset Value */

#define GLUE_LRESET_CONFIG_LRESET_SOURCE_Pos  (0)                                            /**< (GLUE_LRESET_CONFIG) This bit define the source of LRESET_BI#.\n         1= LRESET_BI# comes from the physical pin input PCI_RESET#.\n         0= LRESET_BI# comes from the Chip-Level PCI_RST# (default).\n Position */
#define GLUE_LRESET_CONFIG_LRESET_SOURCE_Msk  (0x1U << GLUE_LRESET_CONFIG_LRESET_SOURCE_Pos)  /**< (GLUE_LRESET_CONFIG) This bit define the source of LRESET_BI#.\n         1= LRESET_BI# comes from the physical pin input PCI_RESET#.\n         0= LRESET_BI# comes from the Chip-Level PCI_RST# (default).\n Mask */
#define GLUE_LRESET_CONFIG_LRESET_CONFIGURED_Pos (7)                                            /**< (GLUE_LRESET_CONFIG) This bit define whether LRESET_SOURCE bit, along with chip-level pin settings are configured or not.\n         1= LRESET_BI# source is configured, and the LRESET_SOURCE bit, along with chip-level pin settings,         defines where it comes from.\n         0= LRESET_BI# source is not fully configured and forced '0' internally (default).\n Position */
#define GLUE_LRESET_CONFIG_LRESET_CONFIGURED_Msk (0x1U << GLUE_LRESET_CONFIG_LRESET_CONFIGURED_Pos)  /**< (GLUE_LRESET_CONFIG) This bit define whether LRESET_SOURCE bit, along with chip-level pin settings are configured or not.\n         1= LRESET_BI# source is configured, and the LRESET_SOURCE bit, along with chip-level pin settings,         defines where it comes from.\n         0= LRESET_BI# source is not fully configured and forced '0' internally (default).\n Mask */
#define GLUE_LRESET_CONFIG_Msk                (0x00000081UL)                                 /**< (GLUE_LRESET_CONFIG) Register Mask  */

/* -------- GLUE_PWR_TURNON_SRC : (GLUE Offset: 0x104) (R/W 32) This register defines whether the SLP_S3_IN# input term comes from a physical pin input or from     the eSPI Virtual Wire SLP_S3#. -------- */

typedef union
{
  struct
  {
    uint32_t TURN_ON_S3_SRC:1;          /**< bit:      0  This field decides whether SLP_S3_IN# comes from the Virtual Wire SLP_S3# or physical SLP_S3# input.\n         1= SLP_S3_IN# comes from the Virtual Wire SLP_S3# (eSPI only).\n         0= SLP_S3_IN# comes from the physical SLP_S3# input (default).\n */
    uint32_t TURN_ON_FW_OFF_EN:1;       /**< bit:      1  This field decides whether Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         1= Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         0= FW_PS_OFF bit has no effect, as constant zero (default).\n */
    uint32_t :5;                        /**< bit:   2..6  Reserved                                      */
    uint32_t TURN_ON_CONFIGURED:1;      /**< bit:      7  This field define whether PS_ON# control sources are fully configured in bits [1:0] of this register.\n         and from chip-level pin function settings.\n         1= PS_ON# control sources are fully configured, from bits [1:0] and from chip-level pin function settings.\n         0= PS_ON# control source is not fully configured and PS_ON# is held in its '1' state (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_PWR_TURNON_SRC_bits_t;
#define GLUE_PWR_TURNON_SRC_RESETVALUE      (0x00U)                                       /**<  (GLUE_PWR_TURNON_SRC) This register defines whether the SLP_S3_IN# input term comes from a physical pin input or from     the eSPI Virtual Wire SLP_S3#.  Reset Value */

