ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_PWR_TURNON_SRC_TURN_ON_S3_SRC_Pos (0)                                            /**< (GLUE_PWR_TURNON_SRC) This field decides whether SLP_S3_IN# comes from the Virtual Wire SLP_S3# or physical SLP_S3# input.\n         1= SLP_S3_IN# comes from the Virtual Wire SLP_S3# (eSPI only).\n         0= SLP_S3_IN# comes from the physical SLP_S3# input (default).\n Position */
#define GLUE_PWR_TURNON_SRC_TURN_ON_S3_SRC_Msk (0x1U << GLUE_PWR_TURNON_SRC_TURN_ON_S3_SRC_Pos)  /**< (GLUE_PWR_TURNON_SRC) This field decides whether SLP_S3_IN# comes from the Virtual Wire SLP_S3# or physical SLP_S3# input.\n         1= SLP_S3_IN# comes from the Virtual Wire SLP_S3# (eSPI only).\n         0= SLP_S3_IN# comes from the physical SLP_S3# input (default).\n Mask */
#define GLUE_PWR_TURNON_SRC_TURN_ON_FW_OFF_EN_Pos (1)                                            /**< (GLUE_PWR_TURNON_SRC) This field decides whether Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         1= Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         0= FW_PS_OFF bit has no effect, as constant zero (default).\n Position */
#define GLUE_PWR_TURNON_SRC_TURN_ON_FW_OFF_EN_Msk (0x1U << GLUE_PWR_TURNON_SRC_TURN_ON_FW_OFF_EN_Pos)  /**< (GLUE_PWR_TURNON_SRC) This field decides whether Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         1= Firmware can use the FW_PS_OFF bit to control PS_ON#.\n         0= FW_PS_OFF bit has no effect, as constant zero (default).\n Mask */
#define GLUE_PWR_TURNON_SRC_TURN_ON_CONFIGURED_Pos (7)                                            /**< (GLUE_PWR_TURNON_SRC) This field define whether PS_ON# control sources are fully configured in bits [1:0] of this register.\n         and from chip-level pin function settings.\n         1= PS_ON# control sources are fully configured, from bits [1:0] and from chip-level pin function settings.\n         0= PS_ON# control source is not fully configured and PS_ON# is held in its '1' state (default).\n Position */
#define GLUE_PWR_TURNON_SRC_TURN_ON_CONFIGURED_Msk (0x1U << GLUE_PWR_TURNON_SRC_TURN_ON_CONFIGURED_Pos)  /**< (GLUE_PWR_TURNON_SRC) This field define whether PS_ON# control sources are fully configured in bits [1:0] of this register.\n         and from chip-level pin function settings.\n         1= PS_ON# control sources are fully configured, from bits [1:0] and from chip-level pin function settings.\n         0= PS_ON# control source is not fully configured and PS_ON# is held in its '1' state (default).\n Mask */
#define GLUE_PWR_TURNON_SRC_Msk               (0x00000083UL)                                 /**< (GLUE_PWR_TURNON_SRC) Register Mask  */

/* -------- GLUE_PWR_FW_OFF : (GLUE Offset: 0x108) (R/W 32) This register may be used by firmware to turn off the PS_ON# pin state, when it would otherwise be on.\n -------- */

typedef union
{
  struct
  {
    uint32_t FW_PS_OFF:1;               /**< bit:      0  1= PS_ON# is forced to the Off (OD high) state. Requires that the TURN_ON_FW_OFF_EN configuration bit is also set to '1'.\n         0= PS_ON# is allowed to follow its SLP_S3_IN# input (default). */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_PWR_FW_OFF_bits_t;
#define GLUE_PWR_FW_OFF_RESETVALUE          (0x00U)                                       /**<  (GLUE_PWR_FW_OFF) This register may be used by firmware to turn off the PS_ON# pin state, when it would otherwise be on.\n  Reset Value */

#define GLUE_PWR_FW_OFF_FW_PS_OFF_Pos         (0)                                            /**< (GLUE_PWR_FW_OFF) 1= PS_ON# is forced to the Off (OD high) state. Requires that the TURN_ON_FW_OFF_EN configuration bit is also set to '1'.\n         0= PS_ON# is allowed to follow its SLP_S3_IN# input (default). Position */
#define GLUE_PWR_FW_OFF_FW_PS_OFF_Msk         (0x1U << GLUE_PWR_FW_OFF_FW_PS_OFF_Pos)        /**< (GLUE_PWR_FW_OFF) 1= PS_ON# is forced to the Off (OD high) state. Requires that the TURN_ON_FW_OFF_EN configuration bit is also set to '1'.\n         0= PS_ON# is allowed to follow its SLP_S3_IN# input (default). Mask */
#define GLUE_PWR_FW_OFF_Msk                   (0x00000001UL)                                 /**< (GLUE_PWR_FW_OFF) Register Mask  */

/* -------- GLUE_PWRGD_STATE_SRC_CFG : (GLUE Offset: 0x10c) (R/W 32) For the low-power S0 state S0ix only, this register defines whether the PWRGD_STATE input term comes \n     from the physical pin PWRGD_PS, or from the PWRGD_S0IX pin, or from a combination of both. PWRGD_STATE \n     comes only from the PWRGD_PS signal in all modes other than S0ix, and this register has no effect. -------- */

typedef union
{
  struct
  {
    uint32_t PWRGD_STATE_SOURCE:2;      /**< bit:   0..1  11= PWRGD_STATE is the logical expression (PWRGD_PS) And (PWRGD_S0IX).\n         10= Reserved.\n          01= PWRGD_STATE comes from the pin input PWRGD_S0IX.\n         00= PWRGD_STATE comes from the pin input PWRGD_PS (default).\n */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_PWRGD_STATE_SRC_CFG_bits_t;
#define GLUE_PWRGD_STATE_SRC_CFG_RESETVALUE (0x00U)                                       /**<  (GLUE_PWRGD_STATE_SRC_CFG) For the low-power S0 state S0ix only, this register defines whether the PWRGD_STATE input term comes \n     from the physical pin PWRGD_PS, or from the PWRGD_S0IX pin, or from a combination of both. PWRGD_STATE \n     comes only from the PWRGD_PS signal in all modes other than S0ix, and this register has no effect.  Reset Value */

#define GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE_Pos (0)                                            /**< (GLUE_PWRGD_STATE_SRC_CFG) 11= PWRGD_STATE is the logical expression (PWRGD_PS) And (PWRGD_S0IX).\n         10= Reserved.\n          01= PWRGD_STATE comes from the pin input PWRGD_S0IX.\n         00= PWRGD_STATE comes from the pin input PWRGD_PS (default).\n Position */
#define GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE_Msk (0x3U << GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE_Pos)  /**< (GLUE_PWRGD_STATE_SRC_CFG) 11= PWRGD_STATE is the logical expression (PWRGD_PS) And (PWRGD_S0IX).\n         10= Reserved.\n          01= PWRGD_STATE comes from the pin input PWRGD_S0IX.\n         00= PWRGD_STATE comes from the pin input PWRGD_PS (default).\n Mask */
#define GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE(value) (GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE_Msk & ((value) << GLUE_PWRGD_STATE_SRC_CFG_PWRGD_STATE_SOURCE_Pos))
#define GLUE_PWRGD_STATE_SRC_CFG_Msk          (0x00000003UL)                                 /**< (GLUE_PWRGD_STATE_SRC_CFG) Register Mask  */

