ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/* -------- GLUE_S0IX_ST_DETECT_CONFIG : (GLUE Offset: 0x110) (R/W 32) This register defines how the S0ix system state is detected. If all conditions are met, as defined by     the S0IX_DET_SOURCE field, and the S0IX_DET_EN bit in the S0ix State Detection Enable Register is also set     to '1', then the S0ix term is defined as '1'; else it is defined as '0'. -------- */

typedef union
{
  struct
  {
    uint32_t S0IX_DET_SOURCE:2;         /**< bit:   0..1  S0ix State is detect.\n         11=S0ix State is detected as the C10 function AND the SLP_S0 function both active, as selected by their\n            respective polarity and source.         10=S0ix State is detected as the C10 function active.\n         01=S0ix State is detected as the SLP_S0 function active.\n         00=S0ix State is not supported, and is presented as a constant '0' (default).\n */
    uint32_t SLP_S0_INV:1;              /**< bit:      2  1= SLP_S0# pin input is from an inverted, high-active, source.\n         0= SLP_S0# pin input is from a low-active source (default).\n */
    uint32_t C10_INV:1;                 /**< bit:      3  1= C10 is from an inverted, low-active, source.\n         0= C10 is from a high-active source (default).\n */
    uint32_t C10_SOURCE:1;              /**< bit:      4  1= C10 comes from the Virtual Wire HOST_C10 (eSPI only).\n         0= C10 comes from the physical pin input CPU_C10 (default).\n */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_S0IX_ST_DETECT_CONFIG_bits_t;
#define GLUE_S0IX_ST_DETECT_CONFIG_RESETVALUE (0x00U)                                       /**<  (GLUE_S0IX_ST_DETECT_CONFIG) This register defines how the S0ix system state is detected. If all conditions are met, as defined by     the S0IX_DET_SOURCE field, and the S0IX_DET_EN bit in the S0ix State Detection Enable Register is also set     to '1', then the S0ix term is defined as '1'; else it is defined as '0'.  Reset Value */

#define GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE_Pos (0)                                            /**< (GLUE_S0IX_ST_DETECT_CONFIG) S0ix State is detect.\n         11=S0ix State is detected as the C10 function AND the SLP_S0 function both active, as selected by their\n            respective polarity and source.         10=S0ix State is detected as the C10 function active.\n         01=S0ix State is detected as the SLP_S0 function active.\n         00=S0ix State is not supported, and is presented as a constant '0' (default).\n Position */
#define GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE_Msk (0x3U << GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE_Pos)  /**< (GLUE_S0IX_ST_DETECT_CONFIG) S0ix State is detect.\n         11=S0ix State is detected as the C10 function AND the SLP_S0 function both active, as selected by their\n            respective polarity and source.         10=S0ix State is detected as the C10 function active.\n         01=S0ix State is detected as the SLP_S0 function active.\n         00=S0ix State is not supported, and is presented as a constant '0' (default).\n Mask */
#define GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE(value) (GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE_Msk & ((value) << GLUE_S0IX_ST_DETECT_CONFIG_S0IX_DET_SOURCE_Pos))
#define GLUE_S0IX_ST_DETECT_CONFIG_SLP_S0_INV_Pos (2)                                            /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= SLP_S0# pin input is from an inverted, high-active, source.\n         0= SLP_S0# pin input is from a low-active source (default).\n Position */
#define GLUE_S0IX_ST_DETECT_CONFIG_SLP_S0_INV_Msk (0x1U << GLUE_S0IX_ST_DETECT_CONFIG_SLP_S0_INV_Pos)  /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= SLP_S0# pin input is from an inverted, high-active, source.\n         0= SLP_S0# pin input is from a low-active source (default).\n Mask */
#define GLUE_S0IX_ST_DETECT_CONFIG_C10_INV_Pos (3)                                            /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= C10 is from an inverted, low-active, source.\n         0= C10 is from a high-active source (default).\n Position */
#define GLUE_S0IX_ST_DETECT_CONFIG_C10_INV_Msk (0x1U << GLUE_S0IX_ST_DETECT_CONFIG_C10_INV_Pos)  /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= C10 is from an inverted, low-active, source.\n         0= C10 is from a high-active source (default).\n Mask */
#define GLUE_S0IX_ST_DETECT_CONFIG_C10_SOURCE_Pos (4)                                            /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= C10 comes from the Virtual Wire HOST_C10 (eSPI only).\n         0= C10 comes from the physical pin input CPU_C10 (default).\n Position */
#define GLUE_S0IX_ST_DETECT_CONFIG_C10_SOURCE_Msk (0x1U << GLUE_S0IX_ST_DETECT_CONFIG_C10_SOURCE_Pos)  /**< (GLUE_S0IX_ST_DETECT_CONFIG) 1= C10 comes from the Virtual Wire HOST_C10 (eSPI only).\n         0= C10 comes from the physical pin input CPU_C10 (default).\n Mask */
#define GLUE_S0IX_ST_DETECT_CONFIG_Msk        (0x0000001FUL)                                 /**< (GLUE_S0IX_ST_DETECT_CONFIG) Register Mask  */

/* -------- GLUE_RESUME_RST : (GLUE Offset: 0x114) (R/W 32) This register provides gating bits for RSMRST# and DPWROK, forcing them both low from a RESET_SYS\n     event (VTR POR) until firmware is ready for them to rise.\n -------- */

typedef union
{
  struct
  {
    uint32_t FW_RESUME_RST:1;           /**< bit:      0  Resume RSMRST# Signal.\n         1= RSMRST# signal is allowed to rise, if hardware conditions are also met.\n         0= RSMRST# signal is forced to 0 regardless of any other hardware conditions (default).\n */
    uint32_t FW_DPWROK:1;               /**< bit:      1  Resume DPWORK Signal.\n         1= DPWROK signal is allowed to rise, if hardware conditions are also met.\n         0= DPWROK signal is forced to 0 regardless of any other hardware conditions (default).\n */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_RESUME_RST_bits_t;
#define GLUE_RESUME_RST_RESETVALUE          (0x00U)                                       /**<  (GLUE_RESUME_RST) This register provides gating bits for RSMRST# and DPWROK, forcing them both low from a RESET_SYS\n     event (VTR POR) until firmware is ready for them to rise.\n  Reset Value */

