ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_RESUME_RST_FW_RESUME_RST_Pos     (0)                                            /**< (GLUE_RESUME_RST) Resume RSMRST# Signal.\n         1= RSMRST# signal is allowed to rise, if hardware conditions are also met.\n         0= RSMRST# signal is forced to 0 regardless of any other hardware conditions (default).\n Position */
#define GLUE_RESUME_RST_FW_RESUME_RST_Msk     (0x1U << GLUE_RESUME_RST_FW_RESUME_RST_Pos)    /**< (GLUE_RESUME_RST) Resume RSMRST# Signal.\n         1= RSMRST# signal is allowed to rise, if hardware conditions are also met.\n         0= RSMRST# signal is forced to 0 regardless of any other hardware conditions (default).\n Mask */
#define GLUE_RESUME_RST_FW_DPWROK_Pos         (1)                                            /**< (GLUE_RESUME_RST) Resume DPWORK Signal.\n         1= DPWROK signal is allowed to rise, if hardware conditions are also met.\n         0= DPWROK signal is forced to 0 regardless of any other hardware conditions (default).\n Position */
#define GLUE_RESUME_RST_FW_DPWROK_Msk         (0x1U << GLUE_RESUME_RST_FW_DPWROK_Pos)        /**< (GLUE_RESUME_RST) Resume DPWORK Signal.\n         1= DPWROK signal is allowed to rise, if hardware conditions are also met.\n         0= DPWROK signal is forced to 0 regardless of any other hardware conditions (default).\n Mask */
#define GLUE_RESUME_RST_Msk                   (0x00000003UL)                                 /**< (GLUE_RESUME_RST) Register Mask  */

/* -------- GLUE_SLP_SUS_L_SRC_CONFIG : (GLUE Offset: 0x118) (R/W 32) This selection defines the SLP_SUS_L# term used in the section above. It is used for both the     SLP_SUS_FET logic and for the RSMRST# logic.\n     This register must be set up before allowing the DPWROK pin to rise. The default state of this     register applies S5 power on unconditionally when rising from a full system G3 state, effective     from the rising edge of DPWROK, and independently of the SLP_SUS# input pin.\n -------- */

typedef union
{
  struct
  {
    uint32_t SLP_SUS_L_SOURCE:2;        /**< bit:   0..1  SLP_SUS_L source selection.\n         0x3= Reserved.\n         0x2= SLP_SUS_L# term is the logical expression (SLP_SUS# pin) And (~FW_SLP_SUS_STATE).\n         0x1= SLP_SUS_L# comes from the pin input SLP_SUS#.\n         0x0= SLP_SUS_L# comes from the inversion of bit FW_SLP_SUS_STATE. (default).\n */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_SLP_SUS_L_SRC_CONFIG_bits_t;
#define GLUE_SLP_SUS_L_SRC_CONFIG_RESETVALUE (0x00U)                                       /**<  (GLUE_SLP_SUS_L_SRC_CONFIG) This selection defines the SLP_SUS_L# term used in the section above. It is used for both the     SLP_SUS_FET logic and for the RSMRST# logic.\n     This register must be set up before allowing the DPWROK pin to rise. The default state of this     register applies S5 power on unconditionally when rising from a full system G3 state, effective     from the rising edge of DPWROK, and independently of the SLP_SUS# input pin.\n  Reset Value */

#define GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE_Pos (0)                                            /**< (GLUE_SLP_SUS_L_SRC_CONFIG) SLP_SUS_L source selection.\n         0x3= Reserved.\n         0x2= SLP_SUS_L# term is the logical expression (SLP_SUS# pin) And (~FW_SLP_SUS_STATE).\n         0x1= SLP_SUS_L# comes from the pin input SLP_SUS#.\n         0x0= SLP_SUS_L# comes from the inversion of bit FW_SLP_SUS_STATE. (default).\n Position */
#define GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE_Msk (0x3U << GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE_Pos)  /**< (GLUE_SLP_SUS_L_SRC_CONFIG) SLP_SUS_L source selection.\n         0x3= Reserved.\n         0x2= SLP_SUS_L# term is the logical expression (SLP_SUS# pin) And (~FW_SLP_SUS_STATE).\n         0x1= SLP_SUS_L# comes from the pin input SLP_SUS#.\n         0x0= SLP_SUS_L# comes from the inversion of bit FW_SLP_SUS_STATE. (default).\n Mask */
#define GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE(value) (GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE_Msk & ((value) << GLUE_SLP_SUS_L_SRC_CONFIG_SLP_SUS_L_SOURCE_Pos))
#define GLUE_SLP_SUS_L_SRC_CONFIG_Msk         (0x00000003UL)                                 /**< (GLUE_SLP_SUS_L_SRC_CONFIG) Register Mask  */

/* -------- GLUE_SLP_SUS_L_FWSRC : (GLUE Offset: 0x11c) (R/W 32) This register provides the Firmware input term for the SLP_SUS_L# expression selected by     the SLP_SUS_L_SOURCE field. Note that this bit is inverted from the sense of the SLP_SUS#     input pin; it is active high to indicate the Sleep state.\n -------- */

typedef union
{
  struct
  {
    uint32_t FW_SLP_SUS_STATE:1;        /**< bit:      0  This register must be set up before     allowing the DPWROK pin to rise. The default state of this register applies S5 power on     unconditionally when rising from a full system G3 state, effective from the rising edge of DPWROK.\n     This bit has no effect unless the SLP_SUS_L_SOURCE field selects it for input.\n     1= Holds SLP_SUS_L# low, if the SLP_SUS_L_SOURCE field selects it.\n     0= Allows SLP_SUS_L# to rise, as defined by the expression selected by the SLP_SUS_L_SOURCE field (default).\n */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_SLP_SUS_L_FWSRC_bits_t;
#define GLUE_SLP_SUS_L_FWSRC_RESETVALUE     (0x00U)                                       /**<  (GLUE_SLP_SUS_L_FWSRC) This register provides the Firmware input term for the SLP_SUS_L# expression selected by     the SLP_SUS_L_SOURCE field. Note that this bit is inverted from the sense of the SLP_SUS#     input pin; it is active high to indicate the Sleep state.\n  Reset Value */

#define GLUE_SLP_SUS_L_FWSRC_FW_SLP_SUS_STATE_Pos (0)                                            /**< (GLUE_SLP_SUS_L_FWSRC) This register must be set up before     allowing the DPWROK pin to rise. The default state of this register applies S5 power on     unconditionally when rising from a full system G3 state, effective from the rising edge of DPWROK.\n     This bit has no effect unless the SLP_SUS_L_SOURCE field selects it for input.\n     1= Holds SLP_SUS_L# low, if the SLP_SUS_L_SOURCE field selects it.\n     0= Allows SLP_SUS_L# to rise, as defined by the expression selected by the SLP_SUS_L_SOURCE field (default).\n Position */
#define GLUE_SLP_SUS_L_FWSRC_FW_SLP_SUS_STATE_Msk (0x1U << GLUE_SLP_SUS_L_FWSRC_FW_SLP_SUS_STATE_Pos)  /**< (GLUE_SLP_SUS_L_FWSRC) This register must be set up before     allowing the DPWROK pin to rise. The default state of this register applies S5 power on     unconditionally when rising from a full system G3 state, effective from the rising edge of DPWROK.\n     This bit has no effect unless the SLP_SUS_L_SOURCE field selects it for input.\n     1= Holds SLP_SUS_L# low, if the SLP_SUS_L_SOURCE field selects it.\n     0= Allows SLP_SUS_L# to rise, as defined by the expression selected by the SLP_SUS_L_SOURCE field (default).\n Mask */
#define GLUE_SLP_SUS_L_FWSRC_Msk              (0x00000001UL)                                 /**< (GLUE_SLP_SUS_L_FWSRC) Register Mask  */

