ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/* -------- GLUE_PCIAUX_CTRL_SRC_CONFIG : (GLUE Offset: 0x120) (R/W 32) This register defines whether the SLP_S4# input term (Table 15.11) comes from the physical pin     function SLP_S4#, or from a Virtual Wire. When coming from an eSPI Virtual Wire, it will designate     an alternate SLP_Sx# source as the SLP_S4# term, simulating an alternate external pin connection.\n     PCIAUX_GATE comes only from an external signal, and this register has no effect on that input.\n -------- */

typedef union
{
  struct
  {
    uint32_t PCIAUX_SLEEP_SOURCE:1;     /**< bit:      0  This bit define the source of SLP_S4# term.\n         1= SLP_S4# term comes from the eSPI Virtual Wire designated in the PCIAUX_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4# term comes from the pin input SLP_S4# (default).\n */
    uint32_t PCIAUX_VWIRE_SOURCE:2;     /**< bit:   1..2  This bit define the source of SLP_S4# term. This field has no effect unless the         PCIAUX_SLEEP_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4# term comes from the Virtual Wire SLP_S5#.\n         0x0= SLP_S4# term comes from the Virtual Wire SLP_S4# (default).\n */
    uint32_t :4;                        /**< bit:   3..6  Reserved                                      */
    uint32_t PCIAUX_CONFIGURED:1;       /**< bit:      7  This bit define whether SLP_S4# term source is fully configured or not.\n         1= SLP_S4# term source is fully configured.\n         0= SLP_S4# term source is not yet configured, and is forced to be a constant 0 (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_PCIAUX_CTRL_SRC_CONFIG_bits_t;
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_RESETVALUE (0x00U)                                       /**<  (GLUE_PCIAUX_CTRL_SRC_CONFIG) This register defines whether the SLP_S4# input term (Table 15.11) comes from the physical pin     function SLP_S4#, or from a Virtual Wire. When coming from an eSPI Virtual Wire, it will designate     an alternate SLP_Sx# source as the SLP_S4# term, simulating an alternate external pin connection.\n     PCIAUX_GATE comes only from an external signal, and this register has no effect on that input.\n  Reset Value */

#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_SLEEP_SOURCE_Pos (0)                                            /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define the source of SLP_S4# term.\n         1= SLP_S4# term comes from the eSPI Virtual Wire designated in the PCIAUX_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4# term comes from the pin input SLP_S4# (default).\n Position */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_SLEEP_SOURCE_Msk (0x1U << GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_SLEEP_SOURCE_Pos)  /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define the source of SLP_S4# term.\n         1= SLP_S4# term comes from the eSPI Virtual Wire designated in the PCIAUX_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4# term comes from the pin input SLP_S4# (default).\n Mask */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE_Pos (1)                                            /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define the source of SLP_S4# term. This field has no effect unless the         PCIAUX_SLEEP_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4# term comes from the Virtual Wire SLP_S5#.\n         0x0= SLP_S4# term comes from the Virtual Wire SLP_S4# (default).\n Position */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE_Msk (0x3U << GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE_Pos)  /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define the source of SLP_S4# term. This field has no effect unless the         PCIAUX_SLEEP_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4# term comes from the Virtual Wire SLP_S5#.\n         0x0= SLP_S4# term comes from the Virtual Wire SLP_S4# (default).\n Mask */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE(value) (GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE_Msk & ((value) << GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_VWIRE_SOURCE_Pos))
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_CONFIGURED_Pos (7)                                            /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define whether SLP_S4# term source is fully configured or not.\n         1= SLP_S4# term source is fully configured.\n         0= SLP_S4# term source is not yet configured, and is forced to be a constant 0 (default).\n Position */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_CONFIGURED_Msk (0x1U << GLUE_PCIAUX_CTRL_SRC_CONFIG_PCIAUX_CONFIGURED_Pos)  /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This bit define whether SLP_S4# term source is fully configured or not.\n         1= SLP_S4# term source is fully configured.\n         0= SLP_S4# term source is not yet configured, and is forced to be a constant 0 (default).\n Mask */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_Msk       (0x00000087UL)                                 /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) Register Mask  */

/* -------- GLUE_BFCUT_SRC_CONFIG : (GLUE Offset: 0x124) (R/W 32) This register defines whether the SLP_S3_BF# and SLP_S4_BF# input terms come from the     physical pin functions SLP_S3# and SLP_S4#, or from Virtual Wires. When coming from an eSPI     Virtual Wire, it can be used to designate alternate SLP_Sx# sources for these terms,     simulating alternate external pin connections.\n -------- */

typedef union
{
  struct
  {
    uint32_t BFCUT_SLP_S3_SRC:1;        /**< bit:      0  This bit define the source of SLP_S3_BF#.\n         1= SLP_S3_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S3_VWIRE_SOURCE         field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_BF# term comes from the pin input SLP_S3# (default).\n */
    uint32_t BFCUT_SLP_S3_VWIRE_SRC:2;  /**< bit:   1..2  This bit define the source of SLP_S3_BF#. This field has no effect unless the         BFCUT_SLP_S3_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S3_BF# term comes from the Virtual Wire SLP_S5#.\n          0x1= SLP_S3_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_BF# term comes from the Virtual Wire SLP_S3# (default).\n */
    uint32_t BFCUT_SLP_S4_SRC:1;        /**< bit:      3  This bit define whether SLP_S4_BF# term comes from.\n         1= SLP_S4_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S4_VWIRE_SOURCE            field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4_BF# term comes from the pin input SLP_S4# (default).\n */
    uint32_t BFCUT_SLP_S4_VWIRE_SRC:2;  /**< bit:   4..5  This bit define the source of SLP_S4_BF#. This field has no effect unless the         BFCUT_SLP_S4_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4_BF# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S4_BF# term comes from the Virtual Wire SLP_S5# (default).\n */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t BFCUT_CONFIGURED:1;        /**< bit:      7  This bit define whether SLP_S4_BF# and SLP_S3_BF# term sources are fully configured or not.\n         1= SLP_S4_BF# and SLP_S3_BF# term sources fully configured.\n         0= SLP_S4_BF# and SLP_S3_BF# term sources not yet configured, and are both forced to be a constant            0 (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_BFCUT_SRC_CONFIG_bits_t;
