ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_BFCUT_SRC_CONFIG_RESETVALUE    (0x00U)                                       /**<  (GLUE_BFCUT_SRC_CONFIG) This register defines whether the SLP_S3_BF# and SLP_S4_BF# input terms come from the     physical pin functions SLP_S3# and SLP_S4#, or from Virtual Wires. When coming from an eSPI     Virtual Wire, it can be used to designate alternate SLP_Sx# sources for these terms,     simulating alternate external pin connections.\n  Reset Value */

#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_SRC_Pos (0)                                            /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S3_BF#.\n         1= SLP_S3_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S3_VWIRE_SOURCE         field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_BF# term comes from the pin input SLP_S3# (default).\n Position */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_SRC_Msk (0x1U << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_SRC_Pos)  /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S3_BF#.\n         1= SLP_S3_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S3_VWIRE_SOURCE         field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_BF# term comes from the pin input SLP_S3# (default).\n Mask */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC_Pos (1)                                            /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S3_BF#. This field has no effect unless the         BFCUT_SLP_S3_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S3_BF# term comes from the Virtual Wire SLP_S5#.\n          0x1= SLP_S3_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_BF# term comes from the Virtual Wire SLP_S3# (default).\n Position */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC_Msk (0x3U << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC_Pos)  /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S3_BF#. This field has no effect unless the         BFCUT_SLP_S3_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S3_BF# term comes from the Virtual Wire SLP_S5#.\n          0x1= SLP_S3_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_BF# term comes from the Virtual Wire SLP_S3# (default).\n Mask */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC(value) (GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC_Msk & ((value) << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S3_VWIRE_SRC_Pos))
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_SRC_Pos (3)                                            /**< (GLUE_BFCUT_SRC_CONFIG) This bit define whether SLP_S4_BF# term comes from.\n         1= SLP_S4_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S4_VWIRE_SOURCE            field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4_BF# term comes from the pin input SLP_S4# (default).\n Position */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_SRC_Msk (0x1U << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_SRC_Pos)  /**< (GLUE_BFCUT_SRC_CONFIG) This bit define whether SLP_S4_BF# term comes from.\n         1= SLP_S4_BF# term comes from the eSPI Virtual Wire designated in the BFCUT_SLP_S4_VWIRE_SOURCE            field. This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S4_BF# term comes from the pin input SLP_S4# (default).\n Mask */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC_Pos (4)                                            /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S4_BF#. This field has no effect unless the         BFCUT_SLP_S4_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4_BF# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S4_BF# term comes from the Virtual Wire SLP_S5# (default).\n Position */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC_Msk (0x3U << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC_Pos)  /**< (GLUE_BFCUT_SRC_CONFIG) This bit define the source of SLP_S4_BF#. This field has no effect unless the         BFCUT_SLP_S4_SOURCE bit is set to 1.\n         0x3= Reserved.\n          0x2= SLP_S4_BF# term comes from the Virtual Wire SLP_S3#.\n          0x1= SLP_S4_BF# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S4_BF# term comes from the Virtual Wire SLP_S5# (default).\n Mask */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC(value) (GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC_Msk & ((value) << GLUE_BFCUT_SRC_CONFIG_BFCUT_SLP_S4_VWIRE_SRC_Pos))
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_CONFIGURED_Pos (7)                                            /**< (GLUE_BFCUT_SRC_CONFIG) This bit define whether SLP_S4_BF# and SLP_S3_BF# term sources are fully configured or not.\n         1= SLP_S4_BF# and SLP_S3_BF# term sources fully configured.\n         0= SLP_S4_BF# and SLP_S3_BF# term sources not yet configured, and are both forced to be a constant            0 (default).\n Position */
#define GLUE_BFCUT_SRC_CONFIG_BFCUT_CONFIGURED_Msk (0x1U << GLUE_BFCUT_SRC_CONFIG_BFCUT_CONFIGURED_Pos)  /**< (GLUE_BFCUT_SRC_CONFIG) This bit define whether SLP_S4_BF# and SLP_S3_BF# term sources are fully configured or not.\n         1= SLP_S4_BF# and SLP_S3_BF# term sources fully configured.\n         0= SLP_S4_BF# and SLP_S3_BF# term sources not yet configured, and are both forced to be a constant            0 (default).\n Mask */
#define GLUE_BFCUT_SRC_CONFIG_Msk             (0x000000BFUL)                                 /**< (GLUE_BFCUT_SRC_CONFIG) Register Mask  */

/* -------- GLUE_SIGMON_INT_STATE : (GLUE Offset: 0x128) (R/W 32) This register provides Signal State of Glue logic for the Firmware.\n -------- */

typedef union
{
  struct
  {
    uint32_t PWRBTN:1;                  /**< bit:      0  This bit reflects the Power button input.\n   */
    uint32_t PS_ON_INTERNAL:1;          /**< bit:      1  This bit reflects the Internal Power Supply turn ON circuitry state and not actual pin status.\n */
    uint32_t SLP_S3N:1;                 /**< bit:      2  This bit reflects the SLP_S3# physical pin status.\n */
    uint32_t SLP_S4N:1;                 /**< bit:      3  This bit reflects the SLP_S4# physical pin status.\n */
    uint32_t SLP_S5N:1;                 /**< bit:      4  This bit reflects the SLP_S5# physical pin status.\n */
    uint32_t PWRGD_STATE:1;             /**< bit:      5  This bit reflects the state of Internal Power Good status.\n */
    uint32_t S0IX_STATE:1;              /**< bit:      6  This bit reflects the internally derived S0IX signal status.\n */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t V3_S5_MON:1;               /**< bit:      8  This bit reflects the V3_S5 physical pin status.\n */
    uint32_t SLP_SUSN:1;                /**< bit:      9  This bit reflects the SLP_SUS# physical pin status.\n */
    uint32_t :1;                        /**< bit:     10  Reserved                                      */
    uint32_t RSMRST_IN_N:1;             /**< bit:     11  This bit reflects the RSMRST# physical pin status.\n */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t DPWROK:1;                  /**< bit:     16  This bit reflects the DPWROK physical pin status.\n */
    uint32_t V5_ALW_MON_RESET:1;        /**< bit:     17  This bit reflects the V5ALW_MON physical pin status.\n */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t INTRUDER:1;                /**< bit:     24  This bit reflects the INTRUDER# physical pin status.\n */
    uint32_t CODE_FETCH:1;              /**< bit:     25  This bit is the mirror of the bit 3 of the LED Register.\n */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_SIGMON_INT_STATE_bits_t;
