ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_SIGMON_INT_STATE_RESETVALUE    (0x00U)                                       /**<  (GLUE_SIGMON_INT_STATE) This register provides Signal State of Glue logic for the Firmware.\n  Reset Value */

#define GLUE_SIGMON_INT_STATE_PWRBTN_Pos      (0)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the Power button input.\n Position */
#define GLUE_SIGMON_INT_STATE_PWRBTN_Msk      (0x1U << GLUE_SIGMON_INT_STATE_PWRBTN_Pos)     /**< (GLUE_SIGMON_INT_STATE) This bit reflects the Power button input.\n Mask */
#define GLUE_SIGMON_INT_STATE_PS_ON_INTERNAL_Pos (1)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the Internal Power Supply turn ON circuitry state and not actual pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_PS_ON_INTERNAL_Msk (0x1U << GLUE_SIGMON_INT_STATE_PS_ON_INTERNAL_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the Internal Power Supply turn ON circuitry state and not actual pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_SLP_S3N_Pos     (2)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S3# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_SLP_S3N_Msk     (0x1U << GLUE_SIGMON_INT_STATE_SLP_S3N_Pos)    /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S3# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_SLP_S4N_Pos     (3)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S4# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_SLP_S4N_Msk     (0x1U << GLUE_SIGMON_INT_STATE_SLP_S4N_Pos)    /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S4# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_SLP_S5N_Pos     (4)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S5# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_SLP_S5N_Msk     (0x1U << GLUE_SIGMON_INT_STATE_SLP_S5N_Pos)    /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_S5# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_PWRGD_STATE_Pos (5)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the state of Internal Power Good status.\n Position */
#define GLUE_SIGMON_INT_STATE_PWRGD_STATE_Msk (0x1U << GLUE_SIGMON_INT_STATE_PWRGD_STATE_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the state of Internal Power Good status.\n Mask */
#define GLUE_SIGMON_INT_STATE_S0IX_STATE_Pos  (6)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the internally derived S0IX signal status.\n Position */
#define GLUE_SIGMON_INT_STATE_S0IX_STATE_Msk  (0x1U << GLUE_SIGMON_INT_STATE_S0IX_STATE_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the internally derived S0IX signal status.\n Mask */
#define GLUE_SIGMON_INT_STATE_V3_S5_MON_Pos   (8)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the V3_S5 physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_V3_S5_MON_Msk   (0x1U << GLUE_SIGMON_INT_STATE_V3_S5_MON_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the V3_S5 physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_SLP_SUSN_Pos    (9)                                            /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_SUS# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_SLP_SUSN_Msk    (0x1U << GLUE_SIGMON_INT_STATE_SLP_SUSN_Pos)   /**< (GLUE_SIGMON_INT_STATE) This bit reflects the SLP_SUS# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_RSMRST_IN_N_Pos (11)                                           /**< (GLUE_SIGMON_INT_STATE) This bit reflects the RSMRST# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_RSMRST_IN_N_Msk (0x1U << GLUE_SIGMON_INT_STATE_RSMRST_IN_N_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the RSMRST# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_DPWROK_Pos      (16)                                           /**< (GLUE_SIGMON_INT_STATE) This bit reflects the DPWROK physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_DPWROK_Msk      (0x1U << GLUE_SIGMON_INT_STATE_DPWROK_Pos)     /**< (GLUE_SIGMON_INT_STATE) This bit reflects the DPWROK physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_V5_ALW_MON_RESET_Pos (17)                                           /**< (GLUE_SIGMON_INT_STATE) This bit reflects the V5ALW_MON physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_V5_ALW_MON_RESET_Msk (0x1U << GLUE_SIGMON_INT_STATE_V5_ALW_MON_RESET_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit reflects the V5ALW_MON physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_INTRUDER_Pos    (24)                                           /**< (GLUE_SIGMON_INT_STATE) This bit reflects the INTRUDER# physical pin status.\n Position */
#define GLUE_SIGMON_INT_STATE_INTRUDER_Msk    (0x1U << GLUE_SIGMON_INT_STATE_INTRUDER_Pos)   /**< (GLUE_SIGMON_INT_STATE) This bit reflects the INTRUDER# physical pin status.\n Mask */
#define GLUE_SIGMON_INT_STATE_CODE_FETCH_Pos  (25)                                           /**< (GLUE_SIGMON_INT_STATE) This bit is the mirror of the bit 3 of the LED Register.\n Position */
#define GLUE_SIGMON_INT_STATE_CODE_FETCH_Msk  (0x1U << GLUE_SIGMON_INT_STATE_CODE_FETCH_Pos)  /**< (GLUE_SIGMON_INT_STATE) This bit is the mirror of the bit 3 of the LED Register.\n Mask */
#define GLUE_SIGMON_INT_STATE_Msk             (0x03030B7FUL)                                 /**< (GLUE_SIGMON_INT_STATE) Register Mask  */

/* -------- GLUE_SIGMON_INT_PNDNG : (GLUE Offset: 0x12c) (R/W 32) This register provides edge detection for bits in the Signal Monitoring State Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t INT_PWRBTN:1;              /**< bit:      0  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_PS_ON_INTERNAL:1;      /**< bit:      1  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_SLP_S3N:1;             /**< bit:      2  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_SLP_S4N:1;             /**< bit:      3  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_SLP_S5N:1;             /**< bit:      4  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_PWRGD_STATE:1;         /**< bit:      5  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_S0IX_STATE:1;          /**< bit:      6  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t INT_V3_S5_MON:1;           /**< bit:      8  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_SLP_SUSN:1;            /**< bit:      9  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t :1;                        /**< bit:     10  Reserved                                      */
    uint32_t INT_RSMRST_IN_N:1;         /**< bit:     11  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t INT_DPWROK:1;              /**< bit:     16  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t INT_V5_ALW_MON_RESET:1;    /**< bit:     17  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t INT_INTRUDER:1;            /**< bit:     24  This bit reports changes in the INTRUDER# pin, under VBAT, as an image of the INTRUSION bit         of the Power-Fail and Reset Status Register. This interrupt must be acknowledged there, and not         here: writing to this bit has no effect.\n */
    uint32_t INT_CODE_FETCH:1;          /**< bit:     25  Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_SIGMON_INT_PNDNG_bits_t;
#define GLUE_SIGMON_INT_PNDNG_RESETVALUE    (0x00U)                                       /**<  (GLUE_SIGMON_INT_PNDNG) This register provides edge detection for bits in the Signal Monitoring State Register.\n  Reset Value */

