ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
#define GLUE_SIGMON_INT_PNDNG_INT_PWRBTN_Pos  (0)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_PWRBTN_Msk  (0x1U << GLUE_SIGMON_INT_PNDNG_INT_PWRBTN_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_PS_ON_INTERNAL_Pos (1)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_PS_ON_INTERNAL_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_PS_ON_INTERNAL_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S3N_Pos (2)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S3N_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_SLP_S3N_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S4N_Pos (3)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S4N_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_SLP_S4N_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S5N_Pos (4)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_S5N_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_SLP_S5N_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_PWRGD_STATE_Pos (5)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_PWRGD_STATE_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_PWRGD_STATE_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_S0IX_STATE_Pos (6)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_S0IX_STATE_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_S0IX_STATE_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_V3_S5_MON_Pos (8)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_V3_S5_MON_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_V3_S5_MON_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_SUSN_Pos (9)                                            /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_SLP_SUSN_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_SLP_SUSN_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_RSMRST_IN_N_Pos (11)                                           /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_RSMRST_IN_N_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_RSMRST_IN_N_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_DPWROK_Pos  (16)                                           /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_DPWROK_Msk  (0x1U << GLUE_SIGMON_INT_PNDNG_INT_DPWROK_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_V5_ALW_MON_RESET_Pos (17)                                           /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_V5_ALW_MON_RESET_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_V5_ALW_MON_RESET_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_INTRUDER_Pos (24)                                           /**< (GLUE_SIGMON_INT_PNDNG) This bit reports changes in the INTRUDER# pin, under VBAT, as an image of the INTRUSION bit         of the Power-Fail and Reset Status Register. This interrupt must be acknowledged there, and not         here: writing to this bit has no effect.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_INTRUDER_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_INTRUDER_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) This bit reports changes in the INTRUDER# pin, under VBAT, as an image of the INTRUSION bit         of the Power-Fail and Reset Status Register. This interrupt must be acknowledged there, and not         here: writing to this bit has no effect.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_INT_CODE_FETCH_Pos (25)                                           /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Position */
#define GLUE_SIGMON_INT_PNDNG_INT_CODE_FETCH_Msk (0x1U << GLUE_SIGMON_INT_PNDNG_INT_CODE_FETCH_Pos)  /**< (GLUE_SIGMON_INT_PNDNG) Set to '1' on each edge of the corresponding Signal Monitor State bit.This is a R/WC bit.\n Mask */
#define GLUE_SIGMON_INT_PNDNG_Msk             (0x03030B7FUL)                                 /**< (GLUE_SIGMON_INT_PNDNG) Register Mask  */

