ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/* -------- GLUE_SIGMON_INT_EN : (GLUE Offset: 0x130) (R/W 32) This register provides Interrupt Enables for corresponding bits in the Interrupt Pending Register.\n -------- */

typedef union
{
  struct
  {
    uint32_t INT_EN_PWRBTN:1;           /**< bit:      0  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_PS_ON_INTERNAL:1;   /**< bit:      1  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_SLP_S3N:1;          /**< bit:      2  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_SLP_S4N:1;          /**< bit:      3  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_SLP_S5N:1;          /**< bit:      4  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_PWRGD_STATE:1;      /**< bit:      5  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_S0IX_STATE:1;       /**< bit:      6  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t INT_EN_V3_S5_MON:1;        /**< bit:      8  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_SLP_SUSN:1;         /**< bit:      9  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t :1;                        /**< bit:     10  Reserved                                      */
    uint32_t INT_EN_RSMRST_IN_N:1;      /**< bit:     11  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t INT_EN_DPWROK:1;           /**< bit:     16  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t INT_EN_V5_ALW_MON_RESET:1;  /**< bit:     17  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t INT_EN_INTRUDER:1;         /**< bit:     24  Enables interrupts from the corresponding Interrupt Pending bit. Note that this bit is         cleared on RESET_SYS, unlike the corresponding bit position in the other registers.\n */
    uint32_t INT_EN_CODE_FETCH:1;       /**< bit:     25  Enables interrupts from the corresponding Interrupt Pending bit.\n */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_SIGMON_INT_EN_bits_t;
#define GLUE_SIGMON_INT_EN_RESETVALUE       (0x00U)                                       /**<  (GLUE_SIGMON_INT_EN) This register provides Interrupt Enables for corresponding bits in the Interrupt Pending Register.\n  Reset Value */

#define GLUE_SIGMON_INT_EN_INT_EN_PWRBTN_Pos  (0)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_PWRBTN_Msk  (0x1U << GLUE_SIGMON_INT_EN_INT_EN_PWRBTN_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_PS_ON_INTERNAL_Pos (1)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_PS_ON_INTERNAL_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_PS_ON_INTERNAL_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S3N_Pos (2)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S3N_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_SLP_S3N_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S4N_Pos (3)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S4N_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_SLP_S4N_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S5N_Pos (4)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_S5N_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_SLP_S5N_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_PWRGD_STATE_Pos (5)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_PWRGD_STATE_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_PWRGD_STATE_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_S0IX_STATE_Pos (6)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_S0IX_STATE_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_S0IX_STATE_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_V3_S5_MON_Pos (8)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_V3_S5_MON_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_V3_S5_MON_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_SUSN_Pos (9)                                            /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_SLP_SUSN_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_SLP_SUSN_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_RSMRST_IN_N_Pos (11)                                           /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_RSMRST_IN_N_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_RSMRST_IN_N_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_DPWROK_Pos  (16)                                           /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_DPWROK_Msk  (0x1U << GLUE_SIGMON_INT_EN_INT_EN_DPWROK_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_V5_ALW_MON_RESET_Pos (17)                                           /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_V5_ALW_MON_RESET_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_V5_ALW_MON_RESET_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_INTRUDER_Pos (24)                                           /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit. Note that this bit is         cleared on RESET_SYS, unlike the corresponding bit position in the other registers.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_INTRUDER_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_INTRUDER_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit. Note that this bit is         cleared on RESET_SYS, unlike the corresponding bit position in the other registers.\n Mask */
#define GLUE_SIGMON_INT_EN_INT_EN_CODE_FETCH_Pos (25)                                           /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Position */
#define GLUE_SIGMON_INT_EN_INT_EN_CODE_FETCH_Msk (0x1U << GLUE_SIGMON_INT_EN_INT_EN_CODE_FETCH_Pos)  /**< (GLUE_SIGMON_INT_EN) Enables interrupts from the corresponding Interrupt Pending bit.\n Mask */
#define GLUE_SIGMON_INT_EN_Msk                (0x03030B7FUL)                                 /**< (GLUE_SIGMON_INT_EN) Register Mask  */

/* -------- GLUE_LED_CNFG_REG : (GLUE Offset: 0x134) (R/W 32) This register defines whether the SLP_S3_L# and SLP_S5_L# input terms (Table 15.16) come from the     physical pin functions SLP_S3# and SLP_S5#, or from Virtual Wires. When coming from an eSPI Virtual Wire,     it may designate alternate SLP_Sx# sources for these terms, simulating alternate external pin connections.\n -------- */

typedef union
{
  struct
  {
    uint32_t LED_SLP_S3_SOURCE:1;       /**< bit:      0  This bit decides the source of LED_SLP_S3_L# term.\n         1= SLP_S3_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S3_VWIRE_SOURCE field.            This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_L# term comes from the pin input SLP_S3# (default).\n */
    uint32_t LED_SLP_S3_VWIRE_SOURCE:2;  /**< bit:   1..2  This bit decides the source of SLP_S3_L# term. This field has no effect unless the LED_SLP_S3_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S3_L# term comes from the Virtual Wire SLP_S5#.\n         0x1= SLP_S3_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_L# term comes from the Virtual Wire SLP_S3# (default).\n */
    uint32_t LED_SLP_S5_SOURCE:1;       /**< bit:      3  This bit decides the source of LED_SLP_S5_L# term.\n         1= SLP_S5_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S5_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S5_L# term comes from the pin input SLP_S5# (default).\n */
    uint32_t LED_SLP_S5_VWIRE_SOURCE:2;  /**< bit:   4..5  This bit decides the source of SLP_S5_L# term. This field has no effect unless the LED_SLP_S5_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S5_L# term comes from the Virtual Wire SLP_S3#.\n         0x1= SLP_S5_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S5_L# term comes from the Virtual Wire SLP_S5# (default).\n */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t LED_CONFIGURED:1;          /**< bit:      7  This bit define whether SLP_S5_L# and SLP_S3_L# term sources are fully configured or not.\n         1= SLP_S5_L# and SLP_S3_L# term sources fully configured.\n         0= SLP_S5_L# and SLP_S3_L# term sources not yet configured and are both forced to be a constant 0 (default).\n */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_LED_CNFG_REG_bits_t;
#define GLUE_LED_CNFG_REG_RESETVALUE        (0x00U)                                       /**<  (GLUE_LED_CNFG_REG) This register defines whether the SLP_S3_L# and SLP_S5_L# input terms (Table 15.16) come from the     physical pin functions SLP_S3# and SLP_S5#, or from Virtual Wires. When coming from an eSPI Virtual Wire,     it may designate alternate SLP_Sx# sources for these terms, simulating alternate external pin connections.\n  Reset Value */

#define GLUE_LED_CNFG_REG_LED_SLP_S3_SOURCE_Pos (0)                                            /**< (GLUE_LED_CNFG_REG) This bit decides the source of LED_SLP_S3_L# term.\n         1= SLP_S3_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S3_VWIRE_SOURCE field.            This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_L# term comes from the pin input SLP_S3# (default).\n Position */
#define GLUE_LED_CNFG_REG_LED_SLP_S3_SOURCE_Msk (0x1U << GLUE_LED_CNFG_REG_LED_SLP_S3_SOURCE_Pos)  /**< (GLUE_LED_CNFG_REG) This bit decides the source of LED_SLP_S3_L# term.\n         1= SLP_S3_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S3_VWIRE_SOURCE field.            This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S3_L# term comes from the pin input SLP_S3# (default).\n Mask */
#define GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE_Pos (1)                                            /**< (GLUE_LED_CNFG_REG) This bit decides the source of SLP_S3_L# term. This field has no effect unless the LED_SLP_S3_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S3_L# term comes from the Virtual Wire SLP_S5#.\n         0x1= SLP_S3_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_L# term comes from the Virtual Wire SLP_S3# (default).\n Position */
#define GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE_Msk (0x3U << GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE_Pos)  /**< (GLUE_LED_CNFG_REG) This bit decides the source of SLP_S3_L# term. This field has no effect unless the LED_SLP_S3_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S3_L# term comes from the Virtual Wire SLP_S5#.\n         0x1= SLP_S3_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S3_L# term comes from the Virtual Wire SLP_S3# (default).\n Mask */
#define GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE(value) (GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE_Msk & ((value) << GLUE_LED_CNFG_REG_LED_SLP_S3_VWIRE_SOURCE_Pos))
#define GLUE_LED_CNFG_REG_LED_SLP_S5_SOURCE_Pos (3)                                            /**< (GLUE_LED_CNFG_REG) This bit decides the source of LED_SLP_S5_L# term.\n         1= SLP_S5_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S5_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S5_L# term comes from the pin input SLP_S5# (default).\n Position */
#define GLUE_LED_CNFG_REG_LED_SLP_S5_SOURCE_Msk (0x1U << GLUE_LED_CNFG_REG_LED_SLP_S5_SOURCE_Pos)  /**< (GLUE_LED_CNFG_REG) This bit decides the source of LED_SLP_S5_L# term.\n         1= SLP_S5_L# term comes from the eSPI Virtual Wire designated in the LED_SLP_S5_VWIRE_SOURCE field.         This selection is Reserved unless eSPI is used as the Host interface.\n         0= SLP_S5_L# term comes from the pin input SLP_S5# (default).\n Mask */
#define GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE_Pos (4)                                            /**< (GLUE_LED_CNFG_REG) This bit decides the source of SLP_S5_L# term. This field has no effect unless the LED_SLP_S5_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S5_L# term comes from the Virtual Wire SLP_S3#.\n         0x1= SLP_S5_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S5_L# term comes from the Virtual Wire SLP_S5# (default).\n Position */
#define GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE_Msk (0x3U << GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE_Pos)  /**< (GLUE_LED_CNFG_REG) This bit decides the source of SLP_S5_L# term. This field has no effect unless the LED_SLP_S5_SOURCE         bit is set to 1.\n         0x3= Reserved.\n         0x2= SLP_S5_L# term comes from the Virtual Wire SLP_S3#.\n         0x1= SLP_S5_L# term comes from the Virtual Wire SLP_S4#.\n         0x0= SLP_S5_L# term comes from the Virtual Wire SLP_S5# (default).\n Mask */
#define GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE(value) (GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE_Msk & ((value) << GLUE_LED_CNFG_REG_LED_SLP_S5_VWIRE_SOURCE_Pos))
#define GLUE_LED_CNFG_REG_LED_CONFIGURED_Pos  (7)                                            /**< (GLUE_LED_CNFG_REG) This bit define whether SLP_S5_L# and SLP_S3_L# term sources are fully configured or not.\n         1= SLP_S5_L# and SLP_S3_L# term sources fully configured.\n         0= SLP_S5_L# and SLP_S3_L# term sources not yet configured and are both forced to be a constant 0 (default).\n Position */
#define GLUE_LED_CNFG_REG_LED_CONFIGURED_Msk  (0x1U << GLUE_LED_CNFG_REG_LED_CONFIGURED_Pos)  /**< (GLUE_LED_CNFG_REG) This bit define whether SLP_S5_L# and SLP_S3_L# term sources are fully configured or not.\n         1= SLP_S5_L# and SLP_S3_L# term sources fully configured.\n         0= SLP_S5_L# and SLP_S3_L# term sources not yet configured and are both forced to be a constant 0 (default).\n Mask */
#define GLUE_LED_CNFG_REG_Msk                 (0x000000BFUL)                                 /**< (GLUE_LED_CNFG_REG) Register Mask  */

/* -------- GLUE_INTRUDER_CTRL_REG : (GLUE Offset: 0x138) (R/W 32) This register contains the Intruder features detection and control bits. -------- */

typedef union
{
  struct
  {
    uint32_t INTRUDER_IN_EN:1;          /**< bit:      0  0= Disable the input to this function from the INTRUDER# pin.\n         1= Enable the INTRUDER# input pin for this function. Should only be enabled when the pin is driven by a VBAT driver.\n */
    uint32_t INTRUSION:1;               /**< bit:      1  When the INTRUDER# input goes high-to-low or low-to-high, this bit will be set. This bit is also set on VBAT POR.         Firmware must write a '1' to clear this bit. Writes of '0' to this bit are ignored. Host CPU software can also clear this bit by writing         '1' to the Host-visible INTRUSION bit of the Intruder Register. Clearing this bit by either method causes it to appear '0' in all images;         here, and in the Intruder Register, and also in the Signal Monitor Interrupt Pending Register */
    uint32_t INTRD_STS:1;               /**< bit:      2  This bit indicates the current status of INTRUDER# pin.\n         0= INTRUDER# pin is 0.\n         1= INTRUDER# pin is 1.\n */
    uint32_t PWRGD_STAT:1;              /**< bit:      3  This bit captures the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE goes low.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __GLUE_INTRUDER_CTRL_REG_bits_t;
#define GLUE_INTRUDER_CTRL_REG_RESETVALUE   (0x02U)                                       /**<  (GLUE_INTRUDER_CTRL_REG) This register contains the Intruder features detection and control bits.  Reset Value */

#define GLUE_INTRUDER_CTRL_REG_INTRUDER_IN_EN_Pos (0)                                            /**< (GLUE_INTRUDER_CTRL_REG) 0= Disable the input to this function from the INTRUDER# pin.\n         1= Enable the INTRUDER# input pin for this function. Should only be enabled when the pin is driven by a VBAT driver.\n Position */
#define GLUE_INTRUDER_CTRL_REG_INTRUDER_IN_EN_Msk (0x1U << GLUE_INTRUDER_CTRL_REG_INTRUDER_IN_EN_Pos)  /**< (GLUE_INTRUDER_CTRL_REG) 0= Disable the input to this function from the INTRUDER# pin.\n         1= Enable the INTRUDER# input pin for this function. Should only be enabled when the pin is driven by a VBAT driver.\n Mask */
#define GLUE_INTRUDER_CTRL_REG_INTRUSION_Pos  (1)                                            /**< (GLUE_INTRUDER_CTRL_REG) When the INTRUDER# input goes high-to-low or low-to-high, this bit will be set. This bit is also set on VBAT POR.         Firmware must write a '1' to clear this bit. Writes of '0' to this bit are ignored. Host CPU software can also clear this bit by writing         '1' to the Host-visible INTRUSION bit of the Intruder Register. Clearing this bit by either method causes it to appear '0' in all images;         here, and in the Intruder Register, and also in the Signal Monitor Interrupt Pending Register Position */
#define GLUE_INTRUDER_CTRL_REG_INTRUSION_Msk  (0x1U << GLUE_INTRUDER_CTRL_REG_INTRUSION_Pos)  /**< (GLUE_INTRUDER_CTRL_REG) When the INTRUDER# input goes high-to-low or low-to-high, this bit will be set. This bit is also set on VBAT POR.         Firmware must write a '1' to clear this bit. Writes of '0' to this bit are ignored. Host CPU software can also clear this bit by writing         '1' to the Host-visible INTRUSION bit of the Intruder Register. Clearing this bit by either method causes it to appear '0' in all images;         here, and in the Intruder Register, and also in the Signal Monitor Interrupt Pending Register Mask */
#define GLUE_INTRUDER_CTRL_REG_INTRD_STS_Pos  (2)                                            /**< (GLUE_INTRUDER_CTRL_REG) This bit indicates the current status of INTRUDER# pin.\n         0= INTRUDER# pin is 0.\n         1= INTRUDER# pin is 1.\n Position */
#define GLUE_INTRUDER_CTRL_REG_INTRD_STS_Msk  (0x1U << GLUE_INTRUDER_CTRL_REG_INTRD_STS_Pos)  /**< (GLUE_INTRUDER_CTRL_REG) This bit indicates the current status of INTRUDER# pin.\n         0= INTRUDER# pin is 0.\n         1= INTRUDER# pin is 1.\n Mask */
#define GLUE_INTRUDER_CTRL_REG_PWRGD_STAT_Pos (3)                                            /**< (GLUE_INTRUDER_CTRL_REG) This bit captures the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE goes low.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n Position */
#define GLUE_INTRUDER_CTRL_REG_PWRGD_STAT_Msk (0x1U << GLUE_INTRUDER_CTRL_REG_PWRGD_STAT_Pos)  /**< (GLUE_INTRUDER_CTRL_REG) This bit captures the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE goes low.\n         0= SLP_S3_IN# was low, and the shutdown was normal. (default).\n         1= SLP_S3_IN# was high, and the shutdown was therefore abnormal.\n Mask */
#define GLUE_INTRUDER_CTRL_REG_Msk            (0x0000000FUL)                                 /**< (GLUE_INTRUDER_CTRL_REG) Register Mask  */

