ranjithaguna/pv/LED_Demo/source/pic32cx/component/glue.h
/** \brief GLUE register offsets definitions */
#define GLUE_PWR_GD_OFFSET           (0x00)         /**< (GLUE_PWR_GD) This is the Power Good Register.\n Offset */
#define GLUE_S0IX_ST_DETECT_EN_OFFSET (0x04)         /**< (GLUE_S0IX_ST_DETECT_EN) This register allows the S0ix system state to be detected, for purposes of switching to an alternate pin for the PWRGD_STATE detection. While this register is in its default state, only     the PWRGD_PS pin is used as PWRGD_STATE.     Since the S0IX_DET_EN bit is reset to 0 by every chip-level PCI Reset event, it is intended for     BIOS software to re-write it to '1' before the first subsequent entry into the S0ix state, if     switching to use the alternate PWRGD_S0IX pin is needed during the S0ix state. Offset */
#define GLUE_POWER_RECOVERY_MODE_OFFSET (0x08)         /**< (GLUE_POWER_RECOVERY_MODE) This register displays the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE last went low. Offset */
#define GLUE_LED_REG_OFFSET          (0x0C)         /**< (GLUE_LED_REG) This is the LED register.\n Offset */
#define GLUE_INTRUDER_REG_OFFSET     (0x10)         /**< (GLUE_INTRUDER_REG) This register provides an image of the Intruder status for the Host CPU. It also allows the CPU     to clear this status directly. This status is also provided to Firmware using the PWRBTN# and Signal     Monitor Register Set, where it can trigger Firmware interrupts. Firmware can use these notifications     to generate SMI, SCI or Wake events to the Host CPU Chipset as appropriate.\n Offset */
#define GLUE_LRESET_CONFIG_OFFSET    (0x100)        /**< (GLUE_LRESET_CONFIG) This register defines whether the LRESET_BI# input term comes from a physical pin or from the chip-level     PCI Reset input. This configuration must be completed before the first application of Main power (S0 power state). Offset */
#define GLUE_PWR_TURNON_SRC_OFFSET   (0x104)        /**< (GLUE_PWR_TURNON_SRC) This register defines whether the SLP_S3_IN# input term comes from a physical pin input or from     the eSPI Virtual Wire SLP_S3#. Offset */
#define GLUE_PWR_FW_OFF_OFFSET       (0x108)        /**< (GLUE_PWR_FW_OFF) This register may be used by firmware to turn off the PS_ON# pin state, when it would otherwise be on.\n Offset */
#define GLUE_PWRGD_STATE_SRC_CFG_OFFSET (0x10C)        /**< (GLUE_PWRGD_STATE_SRC_CFG) For the low-power S0 state S0ix only, this register defines whether the PWRGD_STATE input term comes \n     from the physical pin PWRGD_PS, or from the PWRGD_S0IX pin, or from a combination of both. PWRGD_STATE \n     comes only from the PWRGD_PS signal in all modes other than S0ix, and this register has no effect. Offset */
#define GLUE_S0IX_ST_DETECT_CONFIG_OFFSET (0x110)        /**< (GLUE_S0IX_ST_DETECT_CONFIG) This register defines how the S0ix system state is detected. If all conditions are met, as defined by     the S0IX_DET_SOURCE field, and the S0IX_DET_EN bit in the S0ix State Detection Enable Register is also set     to '1', then the S0ix term is defined as '1'; else it is defined as '0'. Offset */
#define GLUE_RESUME_RST_OFFSET       (0x114)        /**< (GLUE_RESUME_RST) This register provides gating bits for RSMRST# and DPWROK, forcing them both low from a RESET_SYS\n     event (VTR POR) until firmware is ready for them to rise.\n Offset */
#define GLUE_SLP_SUS_L_SRC_CONFIG_OFFSET (0x118)        /**< (GLUE_SLP_SUS_L_SRC_CONFIG) This selection defines the SLP_SUS_L# term used in the section above. It is used for both the     SLP_SUS_FET logic and for the RSMRST# logic.\n     This register must be set up before allowing the DPWROK pin to rise. The default state of this     register applies S5 power on unconditionally when rising from a full system G3 state, effective     from the rising edge of DPWROK, and independently of the SLP_SUS# input pin.\n Offset */
#define GLUE_SLP_SUS_L_FWSRC_OFFSET  (0x11C)        /**< (GLUE_SLP_SUS_L_FWSRC) This register provides the Firmware input term for the SLP_SUS_L# expression selected by     the SLP_SUS_L_SOURCE field. Note that this bit is inverted from the sense of the SLP_SUS#     input pin; it is active high to indicate the Sleep state.\n Offset */
#define GLUE_PCIAUX_CTRL_SRC_CONFIG_OFFSET (0x120)        /**< (GLUE_PCIAUX_CTRL_SRC_CONFIG) This register defines whether the SLP_S4# input term (Table 15.11) comes from the physical pin     function SLP_S4#, or from a Virtual Wire. When coming from an eSPI Virtual Wire, it will designate     an alternate SLP_Sx# source as the SLP_S4# term, simulating an alternate external pin connection.\n     PCIAUX_GATE comes only from an external signal, and this register has no effect on that input.\n Offset */
#define GLUE_BFCUT_SRC_CONFIG_OFFSET (0x124)        /**< (GLUE_BFCUT_SRC_CONFIG) This register defines whether the SLP_S3_BF# and SLP_S4_BF# input terms come from the     physical pin functions SLP_S3# and SLP_S4#, or from Virtual Wires. When coming from an eSPI     Virtual Wire, it can be used to designate alternate SLP_Sx# sources for these terms,     simulating alternate external pin connections.\n Offset */
#define GLUE_SIGMON_INT_STATE_OFFSET (0x128)        /**< (GLUE_SIGMON_INT_STATE) This register provides Signal State of Glue logic for the Firmware.\n Offset */
#define GLUE_SIGMON_INT_PNDNG_OFFSET (0x12C)        /**< (GLUE_SIGMON_INT_PNDNG) This register provides edge detection for bits in the Signal Monitoring State Register.\n Offset */
#define GLUE_SIGMON_INT_EN_OFFSET    (0x130)        /**< (GLUE_SIGMON_INT_EN) This register provides Interrupt Enables for corresponding bits in the Interrupt Pending Register.\n Offset */
#define GLUE_LED_CNFG_REG_OFFSET     (0x134)        /**< (GLUE_LED_CNFG_REG) This register defines whether the SLP_S3_L# and SLP_S5_L# input terms (Table 15.16) come from the     physical pin functions SLP_S3# and SLP_S5#, or from Virtual Wires. When coming from an eSPI Virtual Wire,     it may designate alternate SLP_Sx# sources for these terms, simulating alternate external pin connections.\n Offset */
#define GLUE_INTRUDER_CTRL_REG_OFFSET (0x138)        /**< (GLUE_INTRUDER_CTRL_REG) This register contains the Intruder features detection and control bits. Offset */

/** \brief GLUE register API structure */
typedef struct
{  /* These are the Glue Register */
  __IO  __GLUE_PWR_GD_bits_t           PWR_GD;        /**< Offset: 0x00 (R/W  32) This is the Power Good Register.\n */
  __IO  __GLUE_S0IX_ST_DETECT_EN_bits_t S0IX_ST_DETECT_EN; /**< Offset: 0x04 (R/W  32) This register allows the S0ix system state to be detected, for purposes of switching to an alternate pin for the PWRGD_STATE detection. While this register is in its default state, only     the PWRGD_PS pin is used as PWRGD_STATE.     Since the S0IX_DET_EN bit is reset to 0 by every chip-level PCI Reset event, it is intended for     BIOS software to re-write it to '1' before the first subsequent entry into the S0ix state, if     switching to use the alternate PWRGD_S0IX pin is needed during the S0ix state. */
  __IO  __GLUE_POWER_RECOVERY_MODE_bits_t POWER_RECOVERY_MODE; /**< Offset: 0x08 (R/W  32) This register displays the state of SLP_S3_IN# at the time that the Power Good indicator PWRGD_STATE last went low. */
  __IO  __GLUE_LED_REG_bits_t          LED_REG;       /**< Offset: 0x0C (R/W  32) This is the LED register.\n */
  __IO  __GLUE_INTRUDER_REG_bits_t     INTRUDER_REG;  /**< Offset: 0x10 (R/W  32) This register provides an image of the Intruder status for the Host CPU. It also allows the CPU     to clear this status directly. This status is also provided to Firmware using the PWRBTN# and Signal     Monitor Register Set, where it can trigger Firmware interrupts. Firmware can use these notifications     to generate SMI, SCI or Wake events to the Host CPU Chipset as appropriate.\n */
  __IO  __GLUE_LRESET_CONFIG_bits_t    LRESET_CONFIG; /**< Offset: 0x100 (R/W  32) This register defines whether the LRESET_BI# input term comes from a physical pin or from the chip-level     PCI Reset input. This configuration must be completed before the first application of Main power (S0 power state). */
  __IO  __GLUE_PWR_TURNON_SRC_bits_t   PWR_TURNON_SRC; /**< Offset: 0x104 (R/W  32) This register defines whether the SLP_S3_IN# input term comes from a physical pin input or from     the eSPI Virtual Wire SLP_S3#. */
  __IO  __GLUE_PWR_FW_OFF_bits_t       PWR_FW_OFF;    /**< Offset: 0x108 (R/W  32) This register may be used by firmware to turn off the PS_ON# pin state, when it would otherwise be on.\n */
  __IO  __GLUE_PWRGD_STATE_SRC_CFG_bits_t PWRGD_STATE_SRC_CFG; /**< Offset: 0x10C (R/W  32) For the low-power S0 state S0ix only, this register defines whether the PWRGD_STATE input term comes \n     from the physical pin PWRGD_PS, or from the PWRGD_S0IX pin, or from a combination of both. PWRGD_STATE \n     comes only from the PWRGD_PS signal in all modes other than S0ix, and this register has no effect. */
  __IO  __GLUE_S0IX_ST_DETECT_CONFIG_bits_t S0IX_ST_DETECT_CONFIG; /**< Offset: 0x110 (R/W  32) This register defines how the S0ix system state is detected. If all conditions are met, as defined by     the S0IX_DET_SOURCE field, and the S0IX_DET_EN bit in the S0ix State Detection Enable Register is also set     to '1', then the S0ix term is defined as '1'; else it is defined as '0'. */
  __IO  __GLUE_RESUME_RST_bits_t       RESUME_RST;    /**< Offset: 0x114 (R/W  32) This register provides gating bits for RSMRST# and DPWROK, forcing them both low from a RESET_SYS\n     event (VTR POR) until firmware is ready for them to rise.\n */
  __IO  __GLUE_SLP_SUS_L_SRC_CONFIG_bits_t SLP_SUS_L_SRC_CONFIG; /**< Offset: 0x118 (R/W  32) This selection defines the SLP_SUS_L# term used in the section above. It is used for both the     SLP_SUS_FET logic and for the RSMRST# logic.\n     This register must be set up before allowing the DPWROK pin to rise. The default state of this     register applies S5 power on unconditionally when rising from a full system G3 state, effective     from the rising edge of DPWROK, and independently of the SLP_SUS# input pin.\n */
  __IO  __GLUE_SLP_SUS_L_FWSRC_bits_t  SLP_SUS_L_FWSRC; /**< Offset: 0x11C (R/W  32) This register provides the Firmware input term for the SLP_SUS_L# expression selected by     the SLP_SUS_L_SOURCE field. Note that this bit is inverted from the sense of the SLP_SUS#     input pin; it is active high to indicate the Sleep state.\n */
  __IO  __GLUE_PCIAUX_CTRL_SRC_CONFIG_bits_t PCIAUX_CTRL_SRC_CONFIG; /**< Offset: 0x120 (R/W  32) This register defines whether the SLP_S4# input term (Table 15.11) comes from the physical pin     function SLP_S4#, or from a Virtual Wire. When coming from an eSPI Virtual Wire, it will designate     an alternate SLP_Sx# source as the SLP_S4# term, simulating an alternate external pin connection.\n     PCIAUX_GATE comes only from an external signal, and this register has no effect on that input.\n */
  __IO  __GLUE_BFCUT_SRC_CONFIG_bits_t BFCUT_SRC_CONFIG; /**< Offset: 0x124 (R/W  32) This register defines whether the SLP_S3_BF# and SLP_S4_BF# input terms come from the     physical pin functions SLP_S3# and SLP_S4#, or from Virtual Wires. When coming from an eSPI     Virtual Wire, it can be used to designate alternate SLP_Sx# sources for these terms,     simulating alternate external pin connections.\n */
  __IO  __GLUE_SIGMON_INT_STATE_bits_t SIGMON_INT_STATE; /**< Offset: 0x128 (R/W  32) This register provides Signal State of Glue logic for the Firmware.\n */
  __IO  __GLUE_SIGMON_INT_PNDNG_bits_t SIGMON_INT_PNDNG; /**< Offset: 0x12C (R/W  32) This register provides edge detection for bits in the Signal Monitoring State Register.\n */
  __IO  __GLUE_SIGMON_INT_EN_bits_t    SIGMON_INT_EN; /**< Offset: 0x130 (R/W  32) This register provides Interrupt Enables for corresponding bits in the Interrupt Pending Register.\n */
  __IO  __GLUE_LED_CNFG_REG_bits_t     LED_CNFG_REG;  /**< Offset: 0x134 (R/W  32) This register defines whether the SLP_S3_L# and SLP_S5_L# input terms (Table 15.16) come from the     physical pin functions SLP_S3# and SLP_S5#, or from Virtual Wires. When coming from an eSPI Virtual Wire,     it may designate alternate SLP_Sx# sources for these terms, simulating alternate external pin connections.\n */
  __IO  __GLUE_INTRUDER_CTRL_REG_bits_t INTRUDER_CTRL_REG; /**< Offset: 0x138 (R/W  32) This register contains the Intruder features detection and control bits. */
} glue_registers_t;
/** @}  end of These are the Glue Register */

#endif /* _PIC32CX_0025SD10_GLUE_COMPONENT_H_ */
